tap "caskroom/cask"
tap "git-time-metric/gtm"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/versions"
tap "jmacdonald/amp"
brew "apple-gcc42"
brew "docbook"
brew "asciidoc", args: ["with-docbook-xsl"]
brew "autoconf"
brew "boost"
brew "chruby"
brew "docbook-xsl"
brew "ec2-api-tools"
brew "exercism"
brew "exiftool"
brew "gdbm"
brew "git"
brew "go"
brew "hub"
brew "icu4c"
brew "kakoune", args: ["HEAD"]
brew "libdvdcss"
brew "libffi"
brew "libogg"
brew "libvorbis"
brew "libyaml"
brew "lzo"
brew "lzop"
brew "mercurial"
brew "mongodb"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "pcre"
brew "nginx"
brew "node"
brew "openssl@1.1"
brew "ossp-uuid"
brew "packer"
brew "phantomjs"
brew "readline"
brew "sqlite"
brew "python"
brew "redis"
brew "ruby-build"
brew "ruby-install"
brew "sdl2"
brew "tldr"
brew "wget"
brew "git-time-metric/gtm/gtm"
cask "aerial"
cask "atom"
cask "clipy"
cask "docker"
cask "firefox"
cask "gitbook"
cask "google-earth"
cask "kodi"
cask "licecap"
cask "ngrok"
cask "notion"
cask "oni"
cask "postgres"
cask "postman"
cask "spectacle"
cask "tunnelblick"
cask "zoomus"
