tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "federico-terzi/espanso"
# Ruby environment tool
brew "chruby"
# Client interface to the Amazon EC2 web service
brew "ec2-api-tools"
brew "espanso"
# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Install various Ruby versions and implementations
brew "ruby-build"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
cask "aerial"
cask "docker"
cask "dropbox"
cask "font-fira-code"
cask "google-chrome"
cask "google-drive-file-stream"
cask "hammerspoon"
cask "karabiner-elements"
cask "licecap"
cask "obsidian"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "spotify"
cask "slack"
cask "visual-studio-code"
cask "zoom"
