tap "git-time-metric/gtm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "jmacdonald/amp"
# Standard SGML representation system for technical documents
brew "docbook"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc", args: ["with-docbook-xsl"]
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Parser generator
brew "bison"
# Platform built on V8 to build network applications
brew "node", link: false
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Ruby environment tool
brew "chruby"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Client interface to the Amazon EC2 web service
brew "ec2-api-tools"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Portable Foreign Function Interface library
brew "libffi"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Add GitHub support to git on the command-line
brew "hub"
# Text-based UI library
brew "ncurses"
# Selection-based modal text editor
brew "kakoune", args: ["HEAD"]
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Asynchronous event library
brew "libevent"
# Ogg Bitstream Library
brew "libogg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# YAML Parser
brew "libyaml"
# Real-time data compression library
brew "lzo"
# File compressor
brew "lzop"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Scalable distributed version control system
brew "mercurial"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Perl compatible regular expressions library
brew "pcre"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Persistent key-value database, with built-in net interface
brew "redis"
# Install various Ruby versions and implementations
brew "ruby-build"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Feature-rich console based todo list manager
brew "task"
# Simplified and community-driven man pages
brew "tldr"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Simple, seamless, lightweight time tracking for all your git projects
brew "git-time-metric/gtm/gtm"
cask "aerial"
cask "amethyst"
cask "atom"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "clipy"
cask "discord"
cask "docker"
cask "doxie"
cask "firefox"
cask "font-fira-code"
cask "gitbook"
cask "google-drive-file-stream"
cask "google-photos-backup-and-sync"
cask "hammerspoon"
cask "imageoptim"
cask "impactor"
cask "ios-app-signer"
cask "karabiner-elements"
cask "kodi"
cask "launchrocket"
cask "licecap"
cask "mia-for-gmail"
cask "ngrok"
cask "notion"
cask "nvalt"
cask "oni"
cask "phoenix"
cask "postgres"
cask "postman"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rectangle"
cask "spotify"
cask "taskwarrior-pomodoro"
cask "telegram"
cask "textmate"
cask "transmission"
cask "tunnelbear"
cask "tunnelblick"
cask "visual-studio-code"
cask "vscodium"
cask "webex-meetings"
cask "zoomus"
